{
  "kind": "build_request",
  "title": "Dart Scoring Backend Service (API + Data Model)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a Motoko backend canister that persists dart scoring data models and exposes a Candid API to manage games, players, and scoring events.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Dart Scoring Backend"
        ]
      },
      "acceptanceCriteria": [
        "Backend compiles as a single-actor Motoko canister (all logic in backend/main.mo).",
        "Define Candid types for at least: Player, Game, GameRules, Throw, Turn, Leg (or Round), and GameStatus.",
        "All stored data survives canister upgrades using stable variables (no external DB)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Provide API methods to create and query games and players, including the ability to start a new game with rules and retrieve game state by id.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Dart Scoring Backend"
        ]
      },
      "acceptanceCriteria": [
        "Expose an update method to create a new game (e.g., createGame) that returns a unique GameId.",
        "Expose query methods to list games and fetch a game by id (e.g., listGames, getGame).",
        "Game creation supports configuring rules (at minimum: starting score (e.g., 301/501), double-out on/off, max darts per turn)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement dart scoring logic and an API to record throws/turns and compute scores according to standard rules, including bust handling and optional double-out finishing.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Dart Scoring Backend"
        ]
      },
      "acceptanceCriteria": [
        "Expose an update method to record a scoring event for a player in a specific game (e.g., recordTurn or recordThrows) with validation of segment (1–20, bull) and multiplier (single/double/triple where applicable).",
        "Score computation updates the player’s remaining score correctly; when a bust occurs, the player’s score reverts for that turn and the turn is marked as bust.",
        "If double-out is enabled, a leg/game can only be won when the finishing dart is a double (including double bull as applicable).",
        "Expose a query method to retrieve the current scoreboard for a game (players, remaining scores, legs/sets if modeled, whose turn)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add backend-side validation, error handling, and deterministic IDs for stable operation (no traps on invalid input).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Dart Scoring Backend"
        ]
      },
      "acceptanceCriteria": [
        "All update/query methods return Result-style variants (ok/err) for invalid ids, invalid throws, or illegal state transitions (e.g., recording throws after game is finished).",
        "IDs for games/players are unique and deterministic within the canister (e.g., incrementing counters stored stably).",
        "Provide basic authorization expectations: if no auth is implemented, document and enforce that any caller can create and update games (no hidden assumptions)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Create a minimal frontend shell with a coherent visual theme (colors, typography, spacing, and component styling) applied consistently across the app, without adding additional product features beyond a basic landing scaffold.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Dart Scoring Backend"
        ]
      },
      "acceptanceCriteria": [
        "Frontend renders a simple landing page describing the dart scoring backend and how to use it (English text).",
        "Use a distinct, non-blue/purple visual theme consistently (e.g., pub chalkboard / dartboard-inspired palette with high-contrast typography).",
        "No edits are made to files under frontend/src/components/ui or other immutable paths; compose existing components instead."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Do not modify files under frontend immutable paths (compose instead).",
    "No external databases or third-party backend services."
  ],
  "nonGoals": [
    "Building a full dart scoring UI/UX (match setup screens, live scoreboard UI, animations).",
    "Real-time multiplayer synchronization (no WebSockets/push).",
    "Third-party authentication providers (only Internet Identity is allowed, but not required unless requested)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}